KHILAPY/retro-go-esp32p4/retro-core/components/snes9x/src/gfx.c
/* This file is part of Snes9x. See LICENSE file. */

#include "snes9x.h"

#include "memmap.h"
#include "ppu.h"
#include "cpuexec.h"
#include "display.h"
#include "gfx.h"
#include "apu.h"
#include "esp32p4_opt.h"
#include "fxinst.h"
#include "fxemu.h"

static const uint8_t BitShifts[8][4] =
{
   {2, 2, 2, 2}, /* 0 */
   {4, 4, 2, 0}, /* 1 */
   {4, 4, 0, 0}, /* 2 */
   {8, 4, 0, 0}, /* 3 */
   {8, 2, 0, 0}, /* 4 */
   {4, 2, 0, 0}, /* 5 */
   {4, 0, 0, 0}, /* 6 */
   {8, 0, 0, 0}  /* 7 */
};
static const uint8_t TileShifts[8][4] =
{
   {4, 4, 4, 4}, /* 0 */
   {5, 5, 4, 0}, /* 1 */
   {5, 5, 0, 0}, /* 2 */
   {6, 5, 0, 0}, /* 3 */
   {6, 4, 0, 0}, /* 4 */
   {5, 4, 0, 0}, /* 5 */
   {5, 0, 0, 0}, /* 6 */
   {6, 0, 0, 0}  /* 7 */
};
static const uint8_t PaletteShifts[8][4] =
{
   {2, 2, 2, 2}, /* 0 */
   {4, 4, 2, 0}, /* 1 */
   {4, 4, 0, 0}, /* 2 */
   {0, 4, 0, 0}, /* 3 */
   {0, 2, 0, 0}, /* 4 */
   {4, 2, 0, 0}, /* 5 */
   {4, 0, 0, 0}, /* 6 */
   {0, 0, 0, 0}  /* 7 */
};
static const uint8_t PaletteMasks[8][4] =
{
   {7, 7, 7, 7}, /* 0 */
   {7, 7, 7, 0}, /* 1 */
   {7, 7, 0, 0}, /* 2 */
   {0, 7, 0, 0}, /* 3 */
   {0, 7, 0, 0}, /* 4 */
   {7, 7, 0, 0}, /* 5 */
   {7, 0, 0, 0}, /* 6 */
   {0, 0, 0, 0}  /* 7 */
};
static const uint8_t Depths[8][4] =
{
   {TILE_2BIT, TILE_2BIT, TILE_2BIT, TILE_2BIT}, /* 0 */
   {TILE_4BIT, TILE_4BIT, TILE_2BIT, 0},         /* 1 */
   {TILE_4BIT, TILE_4BIT, 0,         0},         /* 2 */
   {TILE_8BIT, TILE_4BIT, 0,         0},         /* 3 */
   {TILE_8BIT, TILE_2BIT, 0,         0},         /* 4 */
   {TILE_4BIT, TILE_2BIT, 0,         0},         /* 5 */
   {TILE_4BIT, 0,         0,         0},         /* 6 */
   {0,         0,         0,         0}          /* 7 */
};

static NormalTileRenderer  DrawTilePtr;
static ClippedTileRenderer DrawClippedTilePtr;
static NormalTileRenderer  DrawHiResTilePtr;
static ClippedTileRenderer DrawHiResClippedTilePtr;
static LargePixelRenderer  DrawLargePixelPtr;
static uint8_t  Mode7Depths [2];

static struct {
   SLineData LineData[240];
   SLineMatrixData LineMatrixData[240];
   SOBJLines OBJLines[SNES_HEIGHT_EXTENDED];
} *LocalState;

#define LineData LocalState->LineData
#define LineMatrixData LocalState->LineMatrixData

#define CLIP_10_BIT_SIGNED(a) \
   ((a) & ((1 << 10) - 1)) + (((((a) & (1 << 13)) ^ (1 << 13)) - (1 << 13)) >> 3)

#define ON_MAIN(N) \
(GFX.r212c & (1 << (N)))

#define SUB_OR_ADD(N) \
(GFX.r2131 & (1 << (N)))

#define ON_SUB(N) \
((GFX.r2130 & 0x30) != 0x30 && \
 (GFX.r2130 & 2) && \
 (GFX.r212d & (1 << N)))

#define ANYTHING_ON_SUB \
((GFX.r2130 & 0x30) != 0x30 && \
 (GFX.r2130 & 2) && \
 (GFX.r212d & 0x1f))

#define ADD_OR_SUB_ON_ANYTHING \
(GFX.r2131 & 0x3f)

#define FIX_INTERLACE(SCREEN, DO_DEPTH, DEPTH) \
    { \
    uint32_t y; \
    if (IPPU.DoubleHeightPixels && ((PPU.BGMode != 5 && PPU.BGMode != 6) || !IPPU.Interlace)) \
    { \
        for (y = GFX.StartY; y <= GFX.EndY; y++) \
        { \
            /* memmove converted: Same malloc, non-overlapping addresses [Neb] */ \
            memcpy (SCREEN + (y * 2 + 1) * GFX.Pitch2, \
                    SCREEN + y * 2 * GFX.Pitch2, \
                    GFX.Pitch2); \
            if(DO_DEPTH){ \
                /* memmove required: Same malloc, potentially overlapping addresses [Neb] */ \
                memmove (DEPTH + (y * 2 + 1) * (GFX.PPLx2>>1), \
                         DEPTH + y * GFX.PPL, \
                         GFX.PPLx2>>1); \
            } \
        } \
    } \
    }

#define BLACK BUILD_PIXEL(0,0,0)
#define M7 19

void ComputeClipWindows(void);

void DrawTile16(uint32_t Tile, int32_t Offset, uint32_t StartLine, uint32_t LineCount);
void DrawClippedTile16(uint32_t Tile, int32_t Offset, uint32_t StartPixel, uint32_t Width, uint32_t StartLine, uint32_t LineCount);
void DrawTile16HalfWidth(uint32_t Tile, int32_t Offset, uint32_t StartLine, uint32_t LineCount);
void DrawClippedTile16HalfWidth(uint32_t Tile, int32_t Offset, uint32_t StartPixel, uint32_t Width, uint32_t StartLine, uint32_t LineCount);
void DrawTile16x2(uint32_t Tile, int32_t Offset, uint32_t StartLine, uint32_t LineCount);
void DrawClippedTile16x2(uint32_t Tile, int32_t Offset, uint32_t StartPixel, uint32_t Width, uint32_t StartLine, uint32_t LineCount);
void DrawTile16x2x2(uint32_t Tile, int32_t Offset, uint32_t StartLine, uint32_t LineCount);
void DrawClippedTile16x2x2(uint32_t Tile, int32_t Offset, uint32_t StartPixel, uint32_t Width, uint32_t StartLine, uint32_t LineCount);
void DrawLargePixel16(uint32_t Tile, int32_t Offset, uint32_t StartPixel, uint32_t Pixels, uint32_t StartLine, uint32_t LineCount);
void DrawLargePixel16HalfWidth(uint32_t Tile, int32_t Offset, uint32_t StartPixel, uint32_t Pixels, uint32_t StartLine, uint32_t LineCount);
void DrawTile16Add(uint32_t Tile, int32_t Offset, uint32_t StartLine, uint32_t LineCount);
void DrawClippedTile16Add(uint32_t Tile, int32_t Offset, uint32_t StartPixel, uint32_t Width, uint32_t StartLine, uint32_t LineCount);
void DrawTile16Add1_2(uint32_t Tile, int32_t Offset, uint32_t StartLine, uint32_t LineCount);
void DrawClippedTile16Add1_2(uint32_t Tile, int32_t Offset, uint32_t StartPixel, uint32_t Width, uint32_t StartLine, uint32_t LineCount);
void DrawTile16FixedAdd1_2(uint32_t Tile, int32_t Offset, uint32_t StartLine, uint32_t LineCount);
void DrawClippedTile16FixedAdd1_2(uint32_t Tile, int32_t Offset, uint32_t StartPixel, uint32_t Width, uint32_t StartLine, uint32_t LineCount);
void DrawTile16Sub(uint32_t Tile, int32_t Offset, uint32_t StartLine, uint32_t LineCount);
void DrawClippedTile16Sub(uint32_t Tile, int32_t Offset, uint32_t StartPixel, uint32_t Width, uint32_t StartLine, uint32_t LineCount);
void DrawTile16Sub1_2(uint32_t Tile, int32_t Offset, uint32_t StartLine, uint32_t LineCount);
void DrawClippedTile16Sub1_2(uint32_t Tile, int32_t Offset, uint32_t StartPixel, uint32_t Width, uint32_t StartLine, uint32_t LineCount);
void DrawTile16FixedSub1_2(uint32_t Tile, int32_t Offset, uint32_t StartLine, uint32_t LineCount);
void DrawClippedTile16FixedSub1_2(uint32_t Tile, int32_t Offset, uint32_t StartPixel, uint32_t Width, uint32_t StartLine, uint32_t LineCount);
void DrawLargePixel16Add(uint32_t Tile, int32_t Offset, uint32_t StartPixel, uint32_t Pixels, uint32_t StartLine, uint32_t LineCount);
void DrawLargePixel16Add1_2(uint32_t Tile, int32_t Offset, uint32_t StartPixel, uint32_t Pixels, uint32_t StartLine, uint32_t LineCount);
void DrawLargePixel16Sub(uint32_t Tile, int32_t Offset, uint32_t StartPixel, uint32_t Pixels, uint32_t StartLine, uint32_t LineCount);
void DrawLargePixel16Sub1_2(uint32_t Tile, int32_t Offset, uint32_t StartPixel, uint32_t Pixels, uint32_t StartLine, uint32_t LineCount);

bool S9xInitGFX(void)
{
   LocalState = calloc(1, sizeof(*LocalState));
   if (!LocalState)
      return false;

   GFX.OBJLines = LocalState->OBJLines;
   GFX.RealPitch = GFX.Pitch2 = GFX.Pitch;
   GFX.ZPitch = GFX.Pitch;
   GFX.ZPitch >>= 1;
   GFX.Delta = (GFX.SubScreen - GFX.Screen) >> 1;
   GFX.DepthDelta = GFX.SubZBuffer - GFX.ZBuffer;

