KHILAPY/retro-go-esp32p4/retro-core/components/snes9x/src/gfx.c
      uint32_t back = IPPU.ScreenColors [0] | (IPPU.ScreenColors [0] << 16);

      if (PPU.ForcedBlanking)
         back = black;

      if (IPPU.Clip [0].Count[5])
      {
         uint32_t y;
         for (y = starty; y <= endy; y++)
         {
            uint32_t c;
            uint32_t* p = (uint32_t*)(GFX.Screen + y * GFX.Pitch2);
            uint32_t* q = (uint32_t*)((uint16_t*) p + IPPU.RenderedScreenWidth);

            while (p < q)
               *p++ = black;

            for (c = 0; c < IPPU.Clip [0].Count [5]; c++)
            {
               if (IPPU.Clip [0].Right [c][5] > IPPU.Clip [0].Left [c][5])
               {
                  uint16_t* p = (uint16_t*)(GFX.Screen + y * GFX.Pitch2);
                  uint16_t* q = p + IPPU.Clip [0].Right [c][5] * x2;
                  p += IPPU.Clip [0].Left [c][5] * x2;

                  while (p < q)
                     *p++ = (uint16_t) back;
               }
            }
         }
      }
      else
      {
         uint32_t y;
         for (y = starty; y <= endy; y++)
         {
            uint32_t* p = (uint32_t*)(GFX.Screen + y * GFX.Pitch2);
            uint32_t* q = (uint32_t*)((uint16_t*) p + IPPU.RenderedScreenWidth);
            while (p < q)
               *p++ = back;
         }
      }

      if (!PPU.ForcedBlanking)
      {
         uint32_t y;
         for (y = starty; y <= endy; y++)
            memset(GFX.ZBuffer + y * GFX.ZPitch, 0, IPPU.RenderedScreenWidth);
         GFX.DB = GFX.ZBuffer;
         RenderScreen(GFX.Screen, false, true, SUB_SCREEN_DEPTH);
      }
      else
      {
         uint32_t y;
         static uint32_t skip_count = 0;
         skip_count++;
         if (skip_count <= 5 || skip_count % 60 == 0)
         {
            printf("RenderScreen SKIPPED #%lu: ForcedBlanking=1, starty=%lu endy=%lu\n",
                   (unsigned long)skip_count, (unsigned long)starty, (unsigned long)endy);
         }
         for (y = starty; y <= endy; y++)
            memset(GFX.ZBuffer + y * GFX.ZPitch, 0, IPPU.RenderedScreenWidth);
         GFX.DB = GFX.ZBuffer;
         RenderScreen(GFX.Screen, false, true, SUB_SCREEN_DEPTH);
      }
   }

   if (PPU.BGMode != 5 && PPU.BGMode != 6 && IPPU.DoubleWidthPixels)
   {
      /* Mixture of background modes used on screen - scale width
       * of all non-mode 5 and 6 pixels. */
      uint32_t y;
      for (y = starty; y <= endy; y++)
      {
         int32_t x;
         uint16_t* p = (uint16_t*)(GFX.Screen + y * GFX.Pitch2) + 255;
         uint16_t* q = p + 255;
         for (x = 255; x >= 0; x--, p--, q -= 2)
            q[0] = q[1] = p[0];
      }
   }

   /* Double the height of the pixels just drawn */
   FIX_INTERLACE(GFX.Screen, false, GFX.ZBuffer);

   IPPU.PreviousLine = IPPU.CurrentLine;
}

// SuperFX屏幕渲染函数
// 将SuperFX SRAM中的像素数据复制到主屏幕缓冲区
void S9xRenderSuperFXScreen(void)
{
   uint32_t y, x;
   uint16_t *dst_line;
   uint32_t mode;
   uint32_t screen_height;

   mode = GSU.vMode;
   screen_height = GSU.vScreenHeight;

   if (!GSU.apvScreen[0])
   {
      fx_computeScreenPointers();
   }

   if (GSU.apvScreen[0] == NULL)
   {
      return;
   }

   for (y = 0; y < screen_height && y < SNES_HEIGHT; y++)
   {
      dst_line = (uint16_t*)(GFX.Screen + y * GFX.Pitch2);

      switch (mode)
      {
         case 0:
            {
               uint8_t *plane0, *plane1;
               uint8_t mask;
               uint8_t color_index;

               for (x = 0; x < 256; x++)
               {
                  plane0 = GSU.apvScreen[y >> 3] + GSU.x[x >> 3] + ((y & 7) << 1);
                  plane1 = plane0 + 1;
                  
                  mask = 128 >> (x & 7);
                  
                  color_index = 0;
                  if (plane0[0] & mask)
                     color_index |= 0x01;
                  if (plane1[0] & mask)
                     color_index |= 0x02;

                  dst_line[x] = IPPU.ScreenColors[color_index];
               }
            }
            break;

         case 1:
            {
               uint8_t *plane0, *plane1, *plane2, *plane3;
               uint8_t mask;
               uint8_t color_index;

               for (x = 0; x < 256; x++)
               {
                  plane0 = GSU.apvScreen[y >> 3] + GSU.x[x >> 3] + ((y & 7) << 1);
                  plane1 = plane0 + 1;
                  plane2 = plane0 + 0x10;
                  plane3 = plane0 + 0x11;
                  
                  mask = 128 >> (x & 7);
                  
                  color_index = 0;
                  if (plane0[0] & mask)
                     color_index |= 0x01;
                  if (plane1[0] & mask)
                     color_index |= 0x02;
                  if (plane2[0] & mask)
                     color_index |= 0x04;
                  if (plane3[0] & mask)
                     color_index |= 0x08;

                  dst_line[x] = IPPU.ScreenColors[color_index];
               }
            }
            break;

         case 2:
         case 3:
            {
               uint8_t *src;
               uint8_t color_index;

               for (x = 0; x < 256; x++)
               {
                  src = GSU.apvScreen[y >> 3] + GSU.x[x >> 3] + ((y & 7) << 1);
                  color_index = src[(x & 7) ^ 7];

                  dst_line[x] = IPPU.ScreenColors[color_index];
               }
            }
            break;

         default:
            break;
      }
   }
}
